{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\k19056473\Downloads\immigration1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Nov 2019, 14:59:51
{txt}
{com}. 
. use "C:\Users\k19056473\Downloads\immigration.dta"
{txt}
{com}. *Part a
. *Calculate ratio of immigrants to population
. gen immratio=(immpop/pop)*100
{txt}
{com}. 
. *Create a dataset with average house price index and average immigrant ratio 
. collapse hpyear immratio, by(year)
{txt}
{com}. 
. *Calculate the correlation coefficient between the two variables
. corr hpyear immratio
{txt}(obs=8)

             {c |}   hpyear immratio
{hline 13}{c +}{hline 18}
      hpyear {c |}{res}   1.0000
    {txt}immratio {c |}{res}   0.7492   1.0000

{txt}
{com}. 
. *Part b
. *Plot the evolution of both variables over time
. twoway (connected hpyear year, yaxis(1)) (connected immratio year, yaxis(2))
{res}{txt}
{com}. clear
{txt}
{com}. 
. *save "C:\Users\K1217797\Dropbox\KCL\Teaching\201920\Applied Econometrics\Classes\PSet4\immigration_averages.dta", replace
. 
. *Part c
. use "C:\Users\k19056473\Downloads\immigration.dta" 
{txt}
{com}. *Declare data as panel
. egen tvar=group(year)
{txt}
{com}. egen svar=group(uala)
{txt}
{com}. tsset svar tvar 
{res}{txt}{col 8}panel variable:  {res}svar (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}tvar, 1 to 8
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. *Construct the dependent variable in the model (change in log of house prices)
. gen lnhpyear=ln(hpyear)
{txt}
{com}. gen Dlnhpyear=D.lnhpyear
{txt}(170 missing values generated)

{com}. 
. *Construct the independent variable in the model (change in immigrant pop/lagged pop)
. gen Dimmpop=D.immpop
{txt}(170 missing values generated)

{com}. gen Lpop=L.pop
{txt}(170 missing values generated)

{com}. gen imms=Dimmpop/Lpop
{txt}(170 missing values generated)

{com}. xi: xtreg Dlnhpyear imms i.year, fe cluster(svar)
{txt}i.year{col 19}_Iyear_2003-2010{col 39}(naturally coded; _Iyear_2003 omitted)
{p 0 6 2}note: _Iyear_2010 omitted because of collinearity{p_end}
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     1,190
{txt}Group variable: {res}svar{txt}{col 49}Number of groups{col 67}={col 69}{res}       170

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.8071{col 63}{txt}min{col 67}={col 69}{res}         7
{txt}     between = {res}0.0598{col 63}{txt}avg{col 67}={col 69}{res}       7.0
{txt}     overall = {res}0.7869{col 63}{txt}max{col 67}={col 69}{res}         7

{txt}{col 49}F({res}7{txt},{res}169{txt}){col 67}={col 70}{res}  1999.71
{txt}corr(u_i, Xb){col 16}= {res}0.0027{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:170} clusters in svar)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   Dlnhpyear{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}imms {c |}{col 14}{res}{space 2}-.1782485{col 26}{space 2} .0356865{col 37}{space 1}   -4.99{col 46}{space 3}0.000{col 54}{space 4}-.2486971{col 67}{space 3}-.1077998
{txt}{space 1}_Iyear_2004 {c |}{col 14}{res}{space 2} .1144352{col 26}{space 2} .0084684{col 37}{space 1}   13.51{col 46}{space 3}0.000{col 54}{space 4} .0977177{col 67}{space 3} .1311528
{txt}{space 1}_Iyear_2005 {c |}{col 14}{res}{space 2} .0203499{col 26}{space 2} .0059331{col 37}{space 1}    3.43{col 46}{space 3}0.001{col 54}{space 4} .0086373{col 67}{space 3} .0320625
{txt}{space 1}_Iyear_2006 {c |}{col 14}{res}{space 2} .0066931{col 26}{space 2} .0034863{col 37}{space 1}    1.92{col 46}{space 3}0.057{col 54}{space 4}-.0001891{col 67}{space 3} .0135753
{txt}{space 1}_Iyear_2007 {c |}{col 14}{res}{space 2} .0372814{col 26}{space 2} .0025316{col 37}{space 1}   14.73{col 46}{space 3}0.000{col 54}{space 4} .0322837{col 67}{space 3}  .042279
{txt}{space 1}_Iyear_2008 {c |}{col 14}{res}{space 2}-.0795312{col 26}{space 2} .0028754{col 37}{space 1}  -27.66{col 46}{space 3}0.000{col 54}{space 4}-.0852075{col 67}{space 3}-.0738548
{txt}{space 1}_Iyear_2009 {c |}{col 14}{res}{space 2}-.1537678{col 26}{space 2}  .003084{col 37}{space 1}  -49.86{col 46}{space 3}0.000{col 54}{space 4}-.1598559{col 67}{space 3}-.1476796
{txt}{space 1}_Iyear_2010 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}_cons {c |}{col 14}{res}{space 2} .0464887{col 26}{space 2} .0033518{col 37}{space 1}   13.87{col 46}{space 3}0.000{col 54}{space 4} .0398719{col 67}{space 3} .0531055
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .01420752
     {txt}sigma_e {c |} {res} .04182933
         {txt}rho {c |} {res} .10343262{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. save "C:\Users\k19056473\Downloads\immigration_reg.dta"
{txt}file C:\Users\k19056473\Downloads\immigration_reg.dta saved

{com}. 
. 
. use "C:\Users\k19056473\Downloads\immigration.dta" 
{txt}
{com}. egen tvar=group(year)
{txt}
{com}. egen svar=group(uala)
{txt}
{com}. gen lnhpyear=ln(hpyear)
{txt}
{com}. sort uala year
{txt}
{com}. by uala: gen Dlnhpyear=lnhpyear-lnhpyear[_n-1]
{txt}(170 missing values generated)

{com}. by uala: gen Dimmpop=immpop-immpop[_n-1]
{txt}(170 missing values generated)

{com}. by uala: gen Lpop=pop[_n-1]
{txt}(170 missing values generated)

{com}. gen imms=Dimmpop/Lpop
{txt}(170 missing values generated)

{com}. 
. *OLS estimation
. *Least squares dummy variables
. 
. xi: reg Dlnhpyear imms i.year i.uala, cluster(svar)
{txt}i.year{col 19}_Iyear_2003-2010{col 39}(naturally coded; _Iyear_2003 omitted)
i.uala{col 19}_Iuala_1-170{col 39}(_Iuala_1 for uala==09 omitted)
note: _Iyear_2004 omitted because of collinearity

Linear regression                               Number of obs     = {res}     1,190
                                                {txt}{help j_robustsingular:F(6, 169) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.8122
                                                {txt}Root MSE          =    {res} .04183

{txt}{ralign 78:(Std. Err. adjusted for {res:170} clusters in svar)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   Dlnhpyear{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}imms {c |}{col 14}{res}{space 2}-.1782485{col 26}{space 2} .0385485{col 37}{space 1}   -4.62{col 46}{space 3}0.000{col 54}{space 4}-.2543471{col 67}{space 3}-.1021499
{txt}{space 1}_Iyear_2004 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 1}_Iyear_2005 {c |}{col 14}{res}{space 2}-.0940853{col 26}{space 2} .0034303{col 37}{space 1}  -27.43{col 46}{space 3}0.000{col 54}{space 4}-.1008571{col 67}{space 3}-.0873135
{txt}{space 1}_Iyear_2006 {c |}{col 14}{res}{space 2}-.1077422{col 26}{space 2} .0061991{col 37}{space 1}  -17.38{col 46}{space 3}0.000{col 54}{space 4}-.1199799{col 67}{space 3}-.0955045
{txt}{space 1}_Iyear_2007 {c |}{col 14}{res}{space 2}-.0771539{col 26}{space 2} .0083581{col 37}{space 1}   -9.23{col 46}{space 3}0.000{col 54}{space 4}-.0936537{col 67}{space 3}-.0606541
{txt}{space 1}_Iyear_2008 {c |}{col 14}{res}{space 2}-.1939664{col 26}{space 2} .0071516{col 37}{space 1}  -27.12{col 46}{space 3}0.000{col 54}{space 4}-.2080844{col 67}{space 3}-.1798484
{txt}{space 1}_Iyear_2009 {c |}{col 14}{res}{space 2} -.268203{col 26}{space 2}  .007045{col 37}{space 1}  -38.07{col 46}{space 3}0.000{col 54}{space 4}-.2821105{col 67}{space 3}-.2542955
{txt}{space 1}_Iyear_2010 {c |}{col 14}{res}{space 2}-.1144352{col 26}{space 2} .0091476{col 37}{space 1}  -12.51{col 46}{space 3}0.000{col 54}{space 4}-.1324935{col 67}{space 3} -.096377
{txt}{space 4}_Iuala_2 {c |}{col 14}{res}{space 2}  .006614{col 26}{space 2} .0002429{col 37}{space 1}   27.23{col 46}{space 3}0.000{col 54}{space 4} .0061345{col 67}{space 3} .0070934
{txt}{space 4}_Iuala_3 {c |}{col 14}{res}{space 2} .0089736{col 26}{space 2} .0000499{col 37}{space 1}  179.76{col 46}{space 3}0.000{col 54}{space 4}  .008875{col 67}{space 3} .0090721
{txt}{space 4}_Iuala_4 {c |}{col 14}{res}{space 2} .0137056{col 26}{space 2} .0001498{col 37}{space 1}   91.49{col 46}{space 3}0.000{col 54}{space 4} .0134098{col 67}{space 3} .0140013
{txt}{space 4}_Iuala_5 {c |}{col 14}{res}{space 2} .0151054{col 26}{space 2} .0001851{col 37}{space 1}   81.59{col 46}{space 3}0.000{col 54}{space 4} .0147399{col 67}{space 3} .0154709
{txt}{space 4}_Iuala_6 {c |}{col 14}{res}{space 2} .0434611{col 26}{space 2} .0002436{col 37}{space 1}  178.44{col 46}{space 3}0.000{col 54}{space 4} .0429803{col 67}{space 3} .0439419
{txt}{space 4}_Iuala_7 {c |}{col 14}{res}{space 2} .0112134{col 26}{space 2} .0001854{col 37}{space 1}   60.48{col 46}{space 3}0.000{col 54}{space 4} .0108474{col 67}{space 3} .0115794
{txt}{space 4}_Iuala_8 {c |}{col 14}{res}{space 2} .0126901{col 26}{space 2} .0002151{col 37}{space 1}   59.00{col 46}{space 3}0.000{col 54}{space 4} .0122655{col 67}{space 3} .0131146
{txt}{space 4}_Iuala_9 {c |}{col 14}{res}{space 2} .0083134{col 26}{space 2} .0001925{col 37}{space 1}   43.18{col 46}{space 3}0.000{col 54}{space 4} .0079334{col 67}{space 3} .0086935
{txt}{space 3}_Iuala_10 {c |}{col 14}{res}{space 2} .0242948{col 26}{space 2} .0001397{col 37}{space 1}  173.90{col 46}{space 3}0.000{col 54}{space 4}  .024019{col 67}{space 3} .0245706
{txt}{space 3}_Iuala_11 {c |}{col 14}{res}{space 2} .0020371{col 26}{space 2} .0003142{col 37}{space 1}    6.48{col 46}{space 3}0.000{col 54}{space 4} .0014169{col 67}{space 3} .0026573
{txt}{space 3}_Iuala_12 {c |}{col 14}{res}{space 2} .0034643{col 26}{space 2} .0001165{col 37}{space 1}   29.73{col 46}{space 3}0.000{col 54}{space 4} .0032343{col 67}{space 3} .0036943
{txt}{space 3}_Iuala_13 {c |}{col 14}{res}{space 2}  .004468{col 26}{space 2} .0002363{col 37}{space 1}   18.91{col 46}{space 3}0.000{col 54}{space 4} .0040015{col 67}{space 3} .0049345
{txt}{space 3}_Iuala_14 {c |}{col 14}{res}{space 2} .0019819{col 26}{space 2} .0002017{col 37}{space 1}    9.83{col 46}{space 3}0.000{col 54}{space 4} .0015838{col 67}{space 3} .0023801
{txt}{space 3}_Iuala_15 {c |}{col 14}{res}{space 2} .0073851{col 26}{space 2} .0000601{col 37}{space 1}  122.92{col 46}{space 3}0.000{col 54}{space 4} .0072665{col 67}{space 3} .0075037
{txt}{space 3}_Iuala_16 {c |}{col 14}{res}{space 2} .0065691{col 26}{space 2} .0001011{col 37}{space 1}   64.97{col 46}{space 3}0.000{col 54}{space 4} .0063695{col 67}{space 3} .0067687
{txt}{space 3}_Iuala_17 {c |}{col 14}{res}{space 2} .0333715{col 26}{space 2} .0000221{col 37}{space 1} 1512.35{col 46}{space 3}0.000{col 54}{space 4} .0333279{col 67}{space 3}  .033415
{txt}{space 3}_Iuala_18 {c |}{col 14}{res}{space 2} .0021616{col 26}{space 2} .0000988{col 37}{space 1}   21.89{col 46}{space 3}0.000{col 54}{space 4} .0019666{col 67}{space 3} .0023566
{txt}{space 3}_Iuala_19 {c |}{col 14}{res}{space 2} .0048422{col 26}{space 2} .0000509{col 37}{space 1}   95.14{col 46}{space 3}0.000{col 54}{space 4} .0047418{col 67}{space 3} .0049427
{txt}{space 3}_Iuala_20 {c |}{col 14}{res}{space 2} .0092254{col 26}{space 2} .0001237{col 37}{space 1}   74.57{col 46}{space 3}0.000{col 54}{space 4} .0089811{col 67}{space 3} .0094696
{txt}{space 3}_Iuala_21 {c |}{col 14}{res}{space 2}-.0011176{col 26}{space 2} .0002218{col 37}{space 1}   -5.04{col 46}{space 3}0.000{col 54}{space 4}-.0015554{col 67}{space 3}-.0006798
{txt}{space 3}_Iuala_22 {c |}{col 14}{res}{space 2} .0237961{col 26}{space 2} .0001014{col 37}{space 1}  234.63{col 46}{space 3}0.000{col 54}{space 4} .0235959{col 67}{space 3} .0239963
{txt}{space 3}_Iuala_23 {c |}{col 14}{res}{space 2}  .018888{col 26}{space 2} .0002162{col 37}{space 1}   87.35{col 46}{space 3}0.000{col 54}{space 4} .0184611{col 67}{space 3} .0193148
{txt}{space 3}_Iuala_24 {c |}{col 14}{res}{space 2} .0046465{col 26}{space 2} .0000767{col 37}{space 1}   60.56{col 46}{space 3}0.000{col 54}{space 4} .0044951{col 67}{space 3}  .004798
{txt}{space 3}_Iuala_25 {c |}{col 14}{res}{space 2}  .009313{col 26}{space 2} .0001305{col 37}{space 1}   71.35{col 46}{space 3}0.000{col 54}{space 4} .0090553{col 67}{space 3} .0095707
{txt}{space 3}_Iuala_26 {c |}{col 14}{res}{space 2} .0119445{col 26}{space 2}  .000263{col 37}{space 1}   45.41{col 46}{space 3}0.000{col 54}{space 4} .0114252{col 67}{space 3} .0124637
{txt}{space 3}_Iuala_27 {c |}{col 14}{res}{space 2} .0057161{col 26}{space 2} .0001057{col 37}{space 1}   54.06{col 46}{space 3}0.000{col 54}{space 4} .0055074{col 67}{space 3} .0059248
{txt}{space 3}_Iuala_28 {c |}{col 14}{res}{space 2}  .011515{col 26}{space 2} .0001557{col 37}{space 1}   73.97{col 46}{space 3}0.000{col 54}{space 4} .0112077{col 67}{space 3} .0118223
{txt}{space 3}_Iuala_29 {c |}{col 14}{res}{space 2} .0082036{col 26}{space 2} .0000459{col 37}{space 1}  178.72{col 46}{space 3}0.000{col 54}{space 4}  .008113{col 67}{space 3} .0082942
{txt}{space 3}_Iuala_30 {c |}{col 14}{res}{space 2} .0112038{col 26}{space 2} 5.53e-06{col 37}{space 1} 2027.62{col 46}{space 3}0.000{col 54}{space 4} .0111929{col 67}{space 3} .0112147
{txt}{space 3}_Iuala_31 {c |}{col 14}{res}{space 2} .0056325{col 26}{space 2} .0000469{col 37}{space 1}  120.19{col 46}{space 3}0.000{col 54}{space 4}   .00554{col 67}{space 3}  .005725
{txt}{space 3}_Iuala_32 {c |}{col 14}{res}{space 2} .0044186{col 26}{space 2} .0002048{col 37}{space 1}   21.57{col 46}{space 3}0.000{col 54}{space 4} .0040142{col 67}{space 3}  .004823
{txt}{space 3}_Iuala_33 {c |}{col 14}{res}{space 2} .0025882{col 26}{space 2} .0001065{col 37}{space 1}   24.30{col 46}{space 3}0.000{col 54}{space 4} .0023779{col 67}{space 3} .0027985
{txt}{space 3}_Iuala_34 {c |}{col 14}{res}{space 2} .0015703{col 26}{space 2}  .000179{col 37}{space 1}    8.77{col 46}{space 3}0.000{col 54}{space 4}  .001217{col 67}{space 3} .0019237
{txt}{space 3}_Iuala_35 {c |}{col 14}{res}{space 2} .0021296{col 26}{space 2} .0012175{col 37}{space 1}    1.75{col 46}{space 3}0.082{col 54}{space 4}-.0002738{col 67}{space 3}  .004533
{txt}{space 3}_Iuala_36 {c |}{col 14}{res}{space 2} .0162509{col 26}{space 2} .0001064{col 37}{space 1}  152.80{col 46}{space 3}0.000{col 54}{space 4} .0160409{col 67}{space 3} .0164608
{txt}{space 3}_Iuala_37 {c |}{col 14}{res}{space 2} .0026341{col 26}{space 2} .0001113{col 37}{space 1}   23.68{col 46}{space 3}0.000{col 54}{space 4} .0024144{col 67}{space 3} .0028537
{txt}{space 3}_Iuala_38 {c |}{col 14}{res}{space 2} .0127346{col 26}{space 2} .0012905{col 37}{space 1}    9.87{col 46}{space 3}0.000{col 54}{space 4}  .010187{col 67}{space 3} .0152823
{txt}{space 3}_Iuala_39 {c |}{col 14}{res}{space 2} .0105095{col 26}{space 2} .0000749{col 37}{space 1}  140.31{col 46}{space 3}0.000{col 54}{space 4} .0103617{col 67}{space 3} .0106574
{txt}{space 3}_Iuala_40 {c |}{col 14}{res}{space 2} .0443675{col 26}{space 2} .0002951{col 37}{space 1}  150.37{col 46}{space 3}0.000{col 54}{space 4} .0437851{col 67}{space 3}   .04495
{txt}{space 3}_Iuala_41 {c |}{col 14}{res}{space 2}-.0066055{col 26}{space 2} .0008579{col 37}{space 1}   -7.70{col 46}{space 3}0.000{col 54}{space 4}-.0082991{col 67}{space 3} -.004912
{txt}{space 3}_Iuala_42 {c |}{col 14}{res}{space 2} .0153215{col 26}{space 2} 7.76e-06{col 37}{space 1} 1974.38{col 46}{space 3}0.000{col 54}{space 4} .0153062{col 67}{space 3} .0153369
{txt}{space 3}_Iuala_43 {c |}{col 14}{res}{space 2} .0079004{col 26}{space 2} .0005675{col 37}{space 1}   13.92{col 46}{space 3}0.000{col 54}{space 4} .0067801{col 67}{space 3} .0090207
{txt}{space 3}_Iuala_44 {c |}{col 14}{res}{space 2} .0193861{col 26}{space 2} .0012387{col 37}{space 1}   15.65{col 46}{space 3}0.000{col 54}{space 4} .0169408{col 67}{space 3} .0218313
{txt}{space 3}_Iuala_45 {c |}{col 14}{res}{space 2}  .033666{col 26}{space 2} .0014604{col 37}{space 1}   23.05{col 46}{space 3}0.000{col 54}{space 4} .0307831{col 67}{space 3} .0365489
{txt}{space 3}_Iuala_46 {c |}{col 14}{res}{space 2} .0404422{col 26}{space 2}  .000552{col 37}{space 1}   73.26{col 46}{space 3}0.000{col 54}{space 4} .0393524{col 67}{space 3}  .041532
{txt}{space 3}_Iuala_47 {c |}{col 14}{res}{space 2} .0271719{col 26}{space 2} .0003712{col 37}{space 1}   73.19{col 46}{space 3}0.000{col 54}{space 4}  .026439{col 67}{space 3} .0279048
{txt}{space 3}_Iuala_48 {c |}{col 14}{res}{space 2} .0022675{col 26}{space 2}  .001393{col 37}{space 1}    1.63{col 46}{space 3}0.105{col 54}{space 4}-.0004824{col 67}{space 3} .0050175
{txt}{space 3}_Iuala_49 {c |}{col 14}{res}{space 2} .0045178{col 26}{space 2} .0001212{col 37}{space 1}   37.27{col 46}{space 3}0.000{col 54}{space 4} .0042785{col 67}{space 3} .0047571
{txt}{space 3}_Iuala_50 {c |}{col 14}{res}{space 2} .0069718{col 26}{space 2} .0004209{col 37}{space 1}   16.56{col 46}{space 3}0.000{col 54}{space 4} .0061409{col 67}{space 3} .0078026
{txt}{space 3}_Iuala_51 {c |}{col 14}{res}{space 2} .0139582{col 26}{space 2}  .000242{col 37}{space 1}   57.68{col 46}{space 3}0.000{col 54}{space 4} .0134805{col 67}{space 3} .0144359
{txt}{space 3}_Iuala_52 {c |}{col 14}{res}{space 2} .0427362{col 26}{space 2} .0007297{col 37}{space 1}   58.56{col 46}{space 3}0.000{col 54}{space 4} .0412957{col 67}{space 3} .0441768
{txt}{space 3}_Iuala_53 {c |}{col 14}{res}{space 2} .0500239{col 26}{space 2}  .003599{col 37}{space 1}   13.90{col 46}{space 3}0.000{col 54}{space 4} .0429192{col 67}{space 3} .0571286
{txt}{space 3}_Iuala_54 {c |}{col 14}{res}{space 2} .0240764{col 26}{space 2} .0007144{col 37}{space 1}   33.70{col 46}{space 3}0.000{col 54}{space 4} .0226661{col 67}{space 3} .0254867
{txt}{space 3}_Iuala_55 {c |}{col 14}{res}{space 2}  .025608{col 26}{space 2} .0007297{col 37}{space 1}   35.09{col 46}{space 3}0.000{col 54}{space 4} .0241675{col 67}{space 3} .0270485
{txt}{space 3}_Iuala_56 {c |}{col 14}{res}{space 2} .0202492{col 26}{space 2} .0005775{col 37}{space 1}   35.06{col 46}{space 3}0.000{col 54}{space 4} .0191091{col 67}{space 3} .0213892
{txt}{space 3}_Iuala_57 {c |}{col 14}{res}{space 2} .0285529{col 26}{space 2} .0013198{col 37}{space 1}   21.63{col 46}{space 3}0.000{col 54}{space 4} .0259476{col 67}{space 3} .0311583
{txt}{space 3}_Iuala_58 {c |}{col 14}{res}{space 2} .0019599{col 26}{space 2} .0001832{col 37}{space 1}   10.70{col 46}{space 3}0.000{col 54}{space 4} .0015982{col 67}{space 3} .0023217
{txt}{space 3}_Iuala_59 {c |}{col 14}{res}{space 2} .0091991{col 26}{space 2} .0002097{col 37}{space 1}   43.87{col 46}{space 3}0.000{col 54}{space 4} .0087851{col 67}{space 3}  .009613
{txt}{space 3}_Iuala_60 {c |}{col 14}{res}{space 2} .0310423{col 26}{space 2} .0001623{col 37}{space 1}  191.24{col 46}{space 3}0.000{col 54}{space 4} .0307218{col 67}{space 3} .0313627
{txt}{space 3}_Iuala_61 {c |}{col 14}{res}{space 2} .0312406{col 26}{space 2} .0006384{col 37}{space 1}   48.94{col 46}{space 3}0.000{col 54}{space 4} .0299804{col 67}{space 3} .0325008
{txt}{space 3}_Iuala_62 {c |}{col 14}{res}{space 2} .0064563{col 26}{space 2} .0004253{col 37}{space 1}   15.18{col 46}{space 3}0.000{col 54}{space 4} .0056167{col 67}{space 3} .0072959
{txt}{space 3}_Iuala_63 {c |}{col 14}{res}{space 2} .0202367{col 26}{space 2} .0001151{col 37}{space 1}  175.77{col 46}{space 3}0.000{col 54}{space 4} .0200095{col 67}{space 3}  .020464
{txt}{space 3}_Iuala_64 {c |}{col 14}{res}{space 2} .0098256{col 26}{space 2} .0000456{col 37}{space 1}  215.37{col 46}{space 3}0.000{col 54}{space 4} .0097356{col 67}{space 3} .0099157
{txt}{space 3}_Iuala_65 {c |}{col 14}{res}{space 2} .0335436{col 26}{space 2} .0000726{col 37}{space 1}  461.88{col 46}{space 3}0.000{col 54}{space 4} .0334003{col 67}{space 3}  .033687
{txt}{space 3}_Iuala_66 {c |}{col 14}{res}{space 2} .0520735{col 26}{space 2} .0004458{col 37}{space 1}  116.80{col 46}{space 3}0.000{col 54}{space 4} .0511934{col 67}{space 3} .0529536
{txt}{space 3}_Iuala_67 {c |}{col 14}{res}{space 2}  .028169{col 26}{space 2} .0002648{col 37}{space 1}  106.38{col 46}{space 3}0.000{col 54}{space 4} .0276463{col 67}{space 3} .0286918
{txt}{space 3}_Iuala_68 {c |}{col 14}{res}{space 2} .0230073{col 26}{space 2} .0000376{col 37}{space 1}  611.87{col 46}{space 3}0.000{col 54}{space 4} .0229331{col 67}{space 3} .0230815
{txt}{space 3}_Iuala_69 {c |}{col 14}{res}{space 2} .0322694{col 26}{space 2}  .001005{col 37}{space 1}   32.11{col 46}{space 3}0.000{col 54}{space 4} .0302855{col 67}{space 3} .0342533
{txt}{space 3}_Iuala_70 {c |}{col 14}{res}{space 2} .0449904{col 26}{space 2} .0000642{col 37}{space 1}  700.41{col 46}{space 3}0.000{col 54}{space 4} .0448636{col 67}{space 3} .0451172
{txt}{space 3}_Iuala_71 {c |}{col 14}{res}{space 2} .0310682{col 26}{space 2} .0006982{col 37}{space 1}   44.50{col 46}{space 3}0.000{col 54}{space 4} .0296899{col 67}{space 3} .0324465
{txt}{space 3}_Iuala_72 {c |}{col 14}{res}{space 2} .0213523{col 26}{space 2} .0001552{col 37}{space 1}  137.58{col 46}{space 3}0.000{col 54}{space 4}  .021046{col 67}{space 3} .0216587
{txt}{space 3}_Iuala_73 {c |}{col 14}{res}{space 2} .0147678{col 26}{space 2} .0000581{col 37}{space 1}  254.29{col 46}{space 3}0.000{col 54}{space 4} .0146532{col 67}{space 3} .0148825
{txt}{space 3}_Iuala_74 {c |}{col 14}{res}{space 2} .0182226{col 26}{space 2} .0002642{col 37}{space 1}   68.97{col 46}{space 3}0.000{col 54}{space 4} .0177011{col 67}{space 3} .0187442
{txt}{space 3}_Iuala_75 {c |}{col 14}{res}{space 2} .0195655{col 26}{space 2} .0000323{col 37}{space 1}  606.19{col 46}{space 3}0.000{col 54}{space 4} .0195017{col 67}{space 3} .0196292
{txt}{space 3}_Iuala_76 {c |}{col 14}{res}{space 2} .0182634{col 26}{space 2}  .000134{col 37}{space 1}  136.26{col 46}{space 3}0.000{col 54}{space 4} .0179988{col 67}{space 3}  .018528
{txt}{space 3}_Iuala_77 {c |}{col 14}{res}{space 2} .0189973{col 26}{space 2} .0001758{col 37}{space 1}  108.05{col 46}{space 3}0.000{col 54}{space 4} .0186502{col 67}{space 3} .0193444
{txt}{space 3}_Iuala_78 {c |}{col 14}{res}{space 2} .0314787{col 26}{space 2} .0001284{col 37}{space 1}  245.14{col 46}{space 3}0.000{col 54}{space 4} .0312252{col 67}{space 3} .0317322
{txt}{space 3}_Iuala_79 {c |}{col 14}{res}{space 2} .0214653{col 26}{space 2} .0000995{col 37}{space 1}  215.63{col 46}{space 3}0.000{col 54}{space 4} .0212688{col 67}{space 3} .0216619
{txt}{space 3}_Iuala_80 {c |}{col 14}{res}{space 2} .0215204{col 26}{space 2} .0002201{col 37}{space 1}   97.78{col 46}{space 3}0.000{col 54}{space 4}  .021086{col 67}{space 3} .0219549
{txt}{space 3}_Iuala_81 {c |}{col 14}{res}{space 2} .0249199{col 26}{space 2} .0001014{col 37}{space 1}  245.83{col 46}{space 3}0.000{col 54}{space 4} .0247198{col 67}{space 3}   .02512
{txt}{space 3}_Iuala_82 {c |}{col 14}{res}{space 2} .0277343{col 26}{space 2} .0001274{col 37}{space 1}  217.66{col 46}{space 3}0.000{col 54}{space 4} .0274828{col 67}{space 3} .0279859
{txt}{space 3}_Iuala_83 {c |}{col 14}{res}{space 2} .0264414{col 26}{space 2} .0001575{col 37}{space 1}  167.87{col 46}{space 3}0.000{col 54}{space 4} .0261305{col 67}{space 3} .0267524
{txt}{space 3}_Iuala_84 {c |}{col 14}{res}{space 2} .0282548{col 26}{space 2} .0001997{col 37}{space 1}  141.50{col 46}{space 3}0.000{col 54}{space 4} .0278606{col 67}{space 3}  .028649
{txt}{space 3}_Iuala_85 {c |}{col 14}{res}{space 2} .0235587{col 26}{space 2} 2.73e-06{col 37}{space 1} 8619.23{col 46}{space 3}0.000{col 54}{space 4} .0235533{col 67}{space 3} .0235641
{txt}{space 3}_Iuala_86 {c |}{col 14}{res}{space 2} .0170709{col 26}{space 2} .0000406{col 37}{space 1}  420.85{col 46}{space 3}0.000{col 54}{space 4} .0169909{col 67}{space 3}  .017151
{txt}{space 3}_Iuala_87 {c |}{col 14}{res}{space 2} .0112276{col 26}{space 2} .0000632{col 37}{space 1}  177.73{col 46}{space 3}0.000{col 54}{space 4} .0111029{col 67}{space 3} .0113523
{txt}{space 3}_Iuala_88 {c |}{col 14}{res}{space 2} .0153557{col 26}{space 2} .0000422{col 37}{space 1}  363.70{col 46}{space 3}0.000{col 54}{space 4} .0152724{col 67}{space 3} .0154391
{txt}{space 3}_Iuala_89 {c |}{col 14}{res}{space 2} .0176677{col 26}{space 2} .0000881{col 37}{space 1}  200.54{col 46}{space 3}0.000{col 54}{space 4} .0174938{col 67}{space 3} .0178416
{txt}{space 3}_Iuala_90 {c |}{col 14}{res}{space 2} .0195062{col 26}{space 2} .0002095{col 37}{space 1}   93.12{col 46}{space 3}0.000{col 54}{space 4} .0190927{col 67}{space 3} .0199197
{txt}{space 3}_Iuala_91 {c |}{col 14}{res}{space 2} .0002617{col 26}{space 2}  .000072{col 37}{space 1}    3.64{col 46}{space 3}0.000{col 54}{space 4} .0001196{col 67}{space 3} .0004037
{txt}{space 3}_Iuala_92 {c |}{col 14}{res}{space 2} .0095433{col 26}{space 2} .0003636{col 37}{space 1}   26.25{col 46}{space 3}0.000{col 54}{space 4} .0088255{col 67}{space 3} .0102611
{txt}{space 3}_Iuala_93 {c |}{col 14}{res}{space 2} .0076762{col 26}{space 2}  .000327{col 37}{space 1}   23.48{col 46}{space 3}0.000{col 54}{space 4} .0070307{col 67}{space 3} .0083217
{txt}{space 3}_Iuala_94 {c |}{col 14}{res}{space 2} .0089308{col 26}{space 2} .0001345{col 37}{space 1}   66.42{col 46}{space 3}0.000{col 54}{space 4} .0086654{col 67}{space 3} .0091962
{txt}{space 3}_Iuala_95 {c |}{col 14}{res}{space 2}  .002829{col 26}{space 2} .0001095{col 37}{space 1}   25.82{col 46}{space 3}0.000{col 54}{space 4} .0026127{col 67}{space 3} .0030452
{txt}{space 3}_Iuala_96 {c |}{col 14}{res}{space 2} .0034534{col 26}{space 2} .0004936{col 37}{space 1}    7.00{col 46}{space 3}0.000{col 54}{space 4} .0024791{col 67}{space 3} .0044278
{txt}{space 3}_Iuala_97 {c |}{col 14}{res}{space 2} .0090971{col 26}{space 2}  .000411{col 37}{space 1}   22.14{col 46}{space 3}0.000{col 54}{space 4} .0082858{col 67}{space 3} .0099084
{txt}{space 3}_Iuala_98 {c |}{col 14}{res}{space 2}  .037783{col 26}{space 2} .0001048{col 37}{space 1}  360.55{col 46}{space 3}0.000{col 54}{space 4} .0375761{col 67}{space 3} .0379899
{txt}{space 3}_Iuala_99 {c |}{col 14}{res}{space 2} .0345787{col 26}{space 2} .0001803{col 37}{space 1}  191.80{col 46}{space 3}0.000{col 54}{space 4} .0342228{col 67}{space 3} .0349346
{txt}{space 2}_Iuala_100 {c |}{col 14}{res}{space 2} .0230227{col 26}{space 2} .0001542{col 37}{space 1}  149.34{col 46}{space 3}0.000{col 54}{space 4} .0227184{col 67}{space 3} .0233271
{txt}{space 2}_Iuala_101 {c |}{col 14}{res}{space 2} .0121261{col 26}{space 2} .0000458{col 37}{space 1}  264.90{col 46}{space 3}0.000{col 54}{space 4} .0120357{col 67}{space 3} .0122164
{txt}{space 2}_Iuala_102 {c |}{col 14}{res}{space 2} .0156576{col 26}{space 2}  .000101{col 37}{space 1}  155.06{col 46}{space 3}0.000{col 54}{space 4} .0154583{col 67}{space 3} .0158569
{txt}{space 2}_Iuala_103 {c |}{col 14}{res}{space 2} .0447098{col 26}{space 2} .0002762{col 37}{space 1}  161.86{col 46}{space 3}0.000{col 54}{space 4} .0441645{col 67}{space 3}  .045255
{txt}{space 2}_Iuala_104 {c |}{col 14}{res}{space 2} .0435592{col 26}{space 2} .0001427{col 37}{space 1}  305.19{col 46}{space 3}0.000{col 54}{space 4} .0432774{col 67}{space 3} .0438409
{txt}{space 2}_Iuala_105 {c |}{col 14}{res}{space 2} .0324845{col 26}{space 2} .0001829{col 37}{space 1}  177.57{col 46}{space 3}0.000{col 54}{space 4} .0321233{col 67}{space 3} .0328456
{txt}{space 2}_Iuala_106 {c |}{col 14}{res}{space 2} .0283195{col 26}{space 2} .0002358{col 37}{space 1}  120.08{col 46}{space 3}0.000{col 54}{space 4} .0278539{col 67}{space 3} .0287851
{txt}{space 2}_Iuala_107 {c |}{col 14}{res}{space 2} .0178666{col 26}{space 2} .0001596{col 37}{space 1}  111.93{col 46}{space 3}0.000{col 54}{space 4} .0175515{col 67}{space 3} .0181818
{txt}{space 2}_Iuala_108 {c |}{col 14}{res}{space 2}   .01502{col 26}{space 2} .0003031{col 37}{space 1}   49.56{col 46}{space 3}0.000{col 54}{space 4} .0144217{col 67}{space 3} .0156183
{txt}{space 2}_Iuala_109 {c |}{col 14}{res}{space 2} .0126922{col 26}{space 2} .0003941{col 37}{space 1}   32.20{col 46}{space 3}0.000{col 54}{space 4} .0119141{col 67}{space 3} .0134702
{txt}{space 2}_Iuala_110 {c |}{col 14}{res}{space 2} .0485298{col 26}{space 2} .0002824{col 37}{space 1}  171.87{col 46}{space 3}0.000{col 54}{space 4} .0479724{col 67}{space 3} .0490872
{txt}{space 2}_Iuala_111 {c |}{col 14}{res}{space 2} .0153847{col 26}{space 2} .0000539{col 37}{space 1}  285.63{col 46}{space 3}0.000{col 54}{space 4} .0152783{col 67}{space 3}  .015491
{txt}{space 2}_Iuala_112 {c |}{col 14}{res}{space 2} .0425017{col 26}{space 2} .0000899{col 37}{space 1}  472.67{col 46}{space 3}0.000{col 54}{space 4} .0423242{col 67}{space 3} .0426792
{txt}{space 2}_Iuala_113 {c |}{col 14}{res}{space 2} .0200575{col 26}{space 2} .0002063{col 37}{space 1}   97.24{col 46}{space 3}0.000{col 54}{space 4} .0196503{col 67}{space 3} .0204647
{txt}{space 2}_Iuala_114 {c |}{col 14}{res}{space 2} .0283111{col 26}{space 2} .0001896{col 37}{space 1}  149.31{col 46}{space 3}0.000{col 54}{space 4} .0279368{col 67}{space 3} .0286854
{txt}{space 2}_Iuala_115 {c |}{col 14}{res}{space 2} .0224296{col 26}{space 2} .0000386{col 37}{space 1}  580.83{col 46}{space 3}0.000{col 54}{space 4} .0223534{col 67}{space 3} .0225059
{txt}{space 2}_Iuala_116 {c |}{col 14}{res}{space 2} .0164139{col 26}{space 2}  .000039{col 37}{space 1}  420.55{col 46}{space 3}0.000{col 54}{space 4} .0163369{col 67}{space 3}  .016491
{txt}{space 2}_Iuala_117 {c |}{col 14}{res}{space 2} .0071203{col 26}{space 2} .0001639{col 37}{space 1}   43.44{col 46}{space 3}0.000{col 54}{space 4} .0067967{col 67}{space 3} .0074439
{txt}{space 2}_Iuala_118 {c |}{col 14}{res}{space 2} .0099805{col 26}{space 2} .0007339{col 37}{space 1}   13.60{col 46}{space 3}0.000{col 54}{space 4} .0085318{col 67}{space 3} .0114292
{txt}{space 2}_Iuala_119 {c |}{col 14}{res}{space 2} .0084667{col 26}{space 2} 1.02e-06{col 37}{space 1} 8306.41{col 46}{space 3}0.000{col 54}{space 4} .0084647{col 67}{space 3} .0084687
{txt}{space 2}_Iuala_120 {c |}{col 14}{res}{space 2}-.0131953{col 26}{space 2} .0002911{col 37}{space 1}  -45.33{col 46}{space 3}0.000{col 54}{space 4}-.0137699{col 67}{space 3}-.0126206
{txt}{space 2}_Iuala_121 {c |}{col 14}{res}{space 2} .0125503{col 26}{space 2} .0000278{col 37}{space 1}  451.19{col 46}{space 3}0.000{col 54}{space 4} .0124954{col 67}{space 3} .0126052
{txt}{space 2}_Iuala_122 {c |}{col 14}{res}{space 2} .0082706{col 26}{space 2} .0002152{col 37}{space 1}   38.44{col 46}{space 3}0.000{col 54}{space 4} .0078459{col 67}{space 3} .0086954
{txt}{space 2}_Iuala_123 {c |}{col 14}{res}{space 2} .0314593{col 26}{space 2} .0000185{col 37}{space 1} 1696.08{col 46}{space 3}0.000{col 54}{space 4} .0314227{col 67}{space 3}  .031496
{txt}{space 2}_Iuala_124 {c |}{col 14}{res}{space 2} .0153493{col 26}{space 2} .0002026{col 37}{space 1}   75.77{col 46}{space 3}0.000{col 54}{space 4} .0149494{col 67}{space 3} .0157492
{txt}{space 2}_Iuala_125 {c |}{col 14}{res}{space 2}  .013924{col 26}{space 2} .0001024{col 37}{space 1}  136.01{col 46}{space 3}0.000{col 54}{space 4} .0137219{col 67}{space 3} .0141261
{txt}{space 2}_Iuala_126 {c |}{col 14}{res}{space 2} .0074353{col 26}{space 2} .0001318{col 37}{space 1}   56.40{col 46}{space 3}0.000{col 54}{space 4} .0071751{col 67}{space 3} .0076956
{txt}{space 2}_Iuala_127 {c |}{col 14}{res}{space 2} .0061734{col 26}{space 2} .0001211{col 37}{space 1}   51.00{col 46}{space 3}0.000{col 54}{space 4} .0059345{col 67}{space 3} .0064124
{txt}{space 2}_Iuala_128 {c |}{col 14}{res}{space 2} .0176996{col 26}{space 2} .0002117{col 37}{space 1}   83.59{col 46}{space 3}0.000{col 54}{space 4} .0172816{col 67}{space 3} .0181175
{txt}{space 2}_Iuala_129 {c |}{col 14}{res}{space 2} .0036538{col 26}{space 2} .0000776{col 37}{space 1}   47.11{col 46}{space 3}0.000{col 54}{space 4} .0035007{col 67}{space 3}  .003807
{txt}{space 2}_Iuala_130 {c |}{col 14}{res}{space 2}-.0006683{col 26}{space 2} .0003619{col 37}{space 1}   -1.85{col 46}{space 3}0.067{col 54}{space 4}-.0013829{col 67}{space 3} .0000462
{txt}{space 2}_Iuala_131 {c |}{col 14}{res}{space 2} .0010555{col 26}{space 2} .0000555{col 37}{space 1}   19.03{col 46}{space 3}0.000{col 54}{space 4}  .000946{col 67}{space 3} .0011649
{txt}{space 2}_Iuala_132 {c |}{col 14}{res}{space 2}-.0133771{col 26}{space 2} .0002729{col 37}{space 1}  -49.01{col 46}{space 3}0.000{col 54}{space 4} -.013916{col 67}{space 3}-.0128383
{txt}{space 2}_Iuala_133 {c |}{col 14}{res}{space 2} .0044161{col 26}{space 2} .0005291{col 37}{space 1}    8.35{col 46}{space 3}0.000{col 54}{space 4} .0033717{col 67}{space 3} .0054606
{txt}{space 2}_Iuala_134 {c |}{col 14}{res}{space 2} -.004934{col 26}{space 2} 2.02e-06{col 37}{space 1}-2444.87{col 46}{space 3}0.000{col 54}{space 4} -.004938{col 67}{space 3}  -.00493
{txt}{space 2}_Iuala_135 {c |}{col 14}{res}{space 2} .0085547{col 26}{space 2} .0000586{col 37}{space 1}  145.88{col 46}{space 3}0.000{col 54}{space 4} .0084389{col 67}{space 3} .0086704
{txt}{space 2}_Iuala_136 {c |}{col 14}{res}{space 2}-.0039838{col 26}{space 2} .0001666{col 37}{space 1}  -23.91{col 46}{space 3}0.000{col 54}{space 4}-.0043127{col 67}{space 3} -.003655
{txt}{space 2}_Iuala_137 {c |}{col 14}{res}{space 2}-.0028118{col 26}{space 2} .0003494{col 37}{space 1}   -8.05{col 46}{space 3}0.000{col 54}{space 4}-.0035015{col 67}{space 3} -.002122
{txt}{space 2}_Iuala_138 {c |}{col 14}{res}{space 2} .0043619{col 26}{space 2} .0000754{col 37}{space 1}   57.82{col 46}{space 3}0.000{col 54}{space 4}  .004213{col 67}{space 3} .0045108
{txt}{space 2}_Iuala_139 {c |}{col 14}{res}{space 2} .0028532{col 26}{space 2} .0000383{col 37}{space 1}   74.51{col 46}{space 3}0.000{col 54}{space 4} .0027776{col 67}{space 3} .0029288
{txt}{space 2}_Iuala_140 {c |}{col 14}{res}{space 2}-.0020368{col 26}{space 2}  .000102{col 37}{space 1}  -19.98{col 46}{space 3}0.000{col 54}{space 4}-.0022381{col 67}{space 3}-.0018356
{txt}{space 2}_Iuala_141 {c |}{col 14}{res}{space 2} -.003569{col 26}{space 2} .0001658{col 37}{space 1}  -21.53{col 46}{space 3}0.000{col 54}{space 4}-.0038962{col 67}{space 3}-.0032417
{txt}{space 2}_Iuala_142 {c |}{col 14}{res}{space 2} .0101988{col 26}{space 2} .0000898{col 37}{space 1}  113.54{col 46}{space 3}0.000{col 54}{space 4} .0100214{col 67}{space 3} .0103761
{txt}{space 2}_Iuala_143 {c |}{col 14}{res}{space 2} .0058594{col 26}{space 2} 6.89e-06{col 37}{space 1}  849.95{col 46}{space 3}0.000{col 54}{space 4} .0058458{col 67}{space 3}  .005873
{txt}{space 2}_Iuala_144 {c |}{col 14}{res}{space 2} .0006938{col 26}{space 2} .0005115{col 37}{space 1}    1.36{col 46}{space 3}0.177{col 54}{space 4} -.000316{col 67}{space 3} .0017036
{txt}{space 2}_Iuala_145 {c |}{col 14}{res}{space 2}  .020281{col 26}{space 2} .0004518{col 37}{space 1}   44.89{col 46}{space 3}0.000{col 54}{space 4}  .019389{col 67}{space 3} .0211729
{txt}{space 2}_Iuala_146 {c |}{col 14}{res}{space 2}-.0044282{col 26}{space 2} .0000314{col 37}{space 1} -140.92{col 46}{space 3}0.000{col 54}{space 4}-.0044902{col 67}{space 3}-.0043662
{txt}{space 2}_Iuala_147 {c |}{col 14}{res}{space 2}-.0056893{col 26}{space 2}  .000144{col 37}{space 1}  -39.51{col 46}{space 3}0.000{col 54}{space 4}-.0059735{col 67}{space 3} -.005405
{txt}{space 2}_Iuala_148 {c |}{col 14}{res}{space 2} .0109956{col 26}{space 2} .0001138{col 37}{space 1}   96.58{col 46}{space 3}0.000{col 54}{space 4} .0107708{col 67}{space 3} .0112203
{txt}{space 2}_Iuala_149 {c |}{col 14}{res}{space 2} .0402421{col 26}{space 2} .0000428{col 37}{space 1}  940.27{col 46}{space 3}0.000{col 54}{space 4} .0401577{col 67}{space 3} .0403266
{txt}{space 2}_Iuala_150 {c |}{col 14}{res}{space 2}  .040317{col 26}{space 2} .0001043{col 37}{space 1}  386.71{col 46}{space 3}0.000{col 54}{space 4} .0401112{col 67}{space 3} .0405228
{txt}{space 2}_Iuala_151 {c |}{col 14}{res}{space 2}  .021353{col 26}{space 2} .0000329{col 37}{space 1}  649.42{col 46}{space 3}0.000{col 54}{space 4} .0212881{col 67}{space 3}  .021418
{txt}{space 2}_Iuala_152 {c |}{col 14}{res}{space 2} .0220478{col 26}{space 2} .0000649{col 37}{space 1}  339.96{col 46}{space 3}0.000{col 54}{space 4} .0219197{col 67}{space 3} .0221758
{txt}{space 2}_Iuala_153 {c |}{col 14}{res}{space 2} .0202907{col 26}{space 2} .0001132{col 37}{space 1}  179.29{col 46}{space 3}0.000{col 54}{space 4} .0200673{col 67}{space 3} .0205141
{txt}{space 2}_Iuala_154 {c |}{col 14}{res}{space 2} .0204667{col 26}{space 2} .0001722{col 37}{space 1}  118.86{col 46}{space 3}0.000{col 54}{space 4} .0201268{col 67}{space 3} .0208066
{txt}{space 2}_Iuala_155 {c |}{col 14}{res}{space 2} .0302458{col 26}{space 2} .0001764{col 37}{space 1}  171.47{col 46}{space 3}0.000{col 54}{space 4} .0298976{col 67}{space 3}  .030594
{txt}{space 2}_Iuala_156 {c |}{col 14}{res}{space 2} .0412791{col 26}{space 2} .0003046{col 37}{space 1}  135.52{col 46}{space 3}0.000{col 54}{space 4} .0406778{col 67}{space 3} .0418804
{txt}{space 2}_Iuala_157 {c |}{col 14}{res}{space 2} .0352688{col 26}{space 2} .0000126{col 37}{space 1} 2788.90{col 46}{space 3}0.000{col 54}{space 4} .0352438{col 67}{space 3} .0352937
{txt}{space 2}_Iuala_158 {c |}{col 14}{res}{space 2} .0385743{col 26}{space 2} .0002334{col 37}{space 1}  165.28{col 46}{space 3}0.000{col 54}{space 4} .0381136{col 67}{space 3} .0390351
{txt}{space 2}_Iuala_159 {c |}{col 14}{res}{space 2} .0322831{col 26}{space 2} .0001147{col 37}{space 1}  281.57{col 46}{space 3}0.000{col 54}{space 4} .0320567{col 67}{space 3} .0325094
{txt}{space 2}_Iuala_160 {c |}{col 14}{res}{space 2} .0386949{col 26}{space 2} .0001889{col 37}{space 1}  204.81{col 46}{space 3}0.000{col 54}{space 4} .0383219{col 67}{space 3} .0390678
{txt}{space 2}_Iuala_161 {c |}{col 14}{res}{space 2} .0324175{col 26}{space 2} .0003858{col 37}{space 1}   84.02{col 46}{space 3}0.000{col 54}{space 4} .0316559{col 67}{space 3} .0331792
{txt}{space 2}_Iuala_162 {c |}{col 14}{res}{space 2} .0203882{col 26}{space 2} .0000874{col 37}{space 1}  233.24{col 46}{space 3}0.000{col 54}{space 4} .0202157{col 67}{space 3} .0205608
{txt}{space 2}_Iuala_163 {c |}{col 14}{res}{space 2} .0314542{col 26}{space 2} .0001943{col 37}{space 1}  161.92{col 46}{space 3}0.000{col 54}{space 4} .0310707{col 67}{space 3} .0318377
{txt}{space 2}_Iuala_164 {c |}{col 14}{res}{space 2} .0552289{col 26}{space 2} .0000517{col 37}{space 1} 1067.37{col 46}{space 3}0.000{col 54}{space 4} .0551268{col 67}{space 3} .0553311
{txt}{space 2}_Iuala_165 {c |}{col 14}{res}{space 2} .0248278{col 26}{space 2} .0002401{col 37}{space 1}  103.39{col 46}{space 3}0.000{col 54}{space 4} .0243537{col 67}{space 3} .0253018
{txt}{space 2}_Iuala_166 {c |}{col 14}{res}{space 2} .0504017{col 26}{space 2} .0001175{col 37}{space 1}  429.10{col 46}{space 3}0.000{col 54}{space 4} .0501699{col 67}{space 3} .0506336
{txt}{space 2}_Iuala_167 {c |}{col 14}{res}{space 2} .0244883{col 26}{space 2} .0003567{col 37}{space 1}   68.66{col 46}{space 3}0.000{col 54}{space 4} .0237842{col 67}{space 3} .0251924
{txt}{space 2}_Iuala_168 {c |}{col 14}{res}{space 2} .0161045{col 26}{space 2}   .00009{col 37}{space 1}  178.98{col 46}{space 3}0.000{col 54}{space 4} .0159269{col 67}{space 3} .0162821
{txt}{space 2}_Iuala_169 {c |}{col 14}{res}{space 2} .0102431{col 26}{space 2} .0002649{col 37}{space 1}   38.67{col 46}{space 3}0.000{col 54}{space 4} .0097202{col 67}{space 3} .0107661
{txt}{space 2}_Iuala_170 {c |}{col 14}{res}{space 2} .0060443{col 26}{space 2} .0001212{col 37}{space 1}   49.88{col 46}{space 3}0.000{col 54}{space 4} .0058051{col 67}{space 3} .0062836
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1438764{col 26}{space 2} .0057838{col 37}{space 1}   24.88{col 46}{space 3}0.000{col 54}{space 4} .1324586{col 67}{space 3} .1552942
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *Part e
. *IV estimation
. clear
{txt}
{com}. use "C:\Users\k19056473\Downloads\immigration_reg.dta"
{txt}
{com}. xi: xtivreg2 Dlnhpyear i.year (imms=inst), fe first cluster(svar) 
{txt}i.year{col 19}_Iyear_2003-2010{col 39}(naturally coded; _Iyear_2003 omitted)
Warning - collinearities detected
Vars dropped:{col 21}_Iyear_2010
{res}
{txt}FIXED EFFECTS ESTIMATION
{hline 24}
Number of groups = {res}      170{col 49}{txt}Obs per group: min{col 68}={col 70}{res}        7
{txt}{col 64}avg{col 68}={col 70}{res}      7.0
{txt}{col 64}max{col 68}={col 70}{res}        7
{txt}Warning - collinearities detected
Vars dropped:{col 16}_Iyear_2010

First-stage regressions
{hline 23}


FIXED EFFECTS ESTIMATION
{hline 24}
Number of groups = {res}      170{col 49}{txt}Obs per group: min{col 68}={col 70}{res}        7
{txt}{col 64}avg{col 68}={col 70}{res}      7.0
{txt}{col 64}max{col 68}={col 70}{res}        7

{txt}First-stage regression of imms:

Statistics robust to heteroskedasticity and clustering on svar
Number of obs = {col 31}{res}    1190
{txt}Number of clusters (svar) = {col 33}{res}   170
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        imms{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}inst {c |}{col 14}{res}{space 2} .9031374{col 26}{space 2} .2677343{col 37}{space 1}    3.37{col 46}{space 3}0.001{col 54}{space 4} .3777602{col 67}{space 3} 1.428515
{txt}{space 1}_Iyear_2004 {c |}{col 14}{res}{space 2} .0026424{col 26}{space 2} .0054192{col 37}{space 1}    0.49{col 46}{space 3}0.626{col 54}{space 4}-.0079918{col 67}{space 3} .0132766
{txt}{space 1}_Iyear_2005 {c |}{col 14}{res}{space 2} .0012732{col 26}{space 2} .0046393{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-.0078305{col 67}{space 3} .0103768
{txt}{space 1}_Iyear_2006 {c |}{col 14}{res}{space 2} .0009383{col 26}{space 2} .0047305{col 37}{space 1}    0.20{col 46}{space 3}0.843{col 54}{space 4}-.0083444{col 67}{space 3} .0102211
{txt}{space 1}_Iyear_2007 {c |}{col 14}{res}{space 2}  .003162{col 26}{space 2} .0047474{col 37}{space 1}    0.67{col 46}{space 3}0.506{col 54}{space 4}-.0061539{col 67}{space 3} .0124779
{txt}{space 1}_Iyear_2008 {c |}{col 14}{res}{space 2} .0014564{col 26}{space 2} .0045315{col 37}{space 1}    0.32{col 46}{space 3}0.748{col 54}{space 4}-.0074359{col 67}{space 3} .0103487
{txt}{space 1}_Iyear_2009 {c |}{col 14}{res}{space 2} .0018274{col 26}{space 2} .0044265{col 37}{space 1}    0.41{col 46}{space 3}0.680{col 54}{space 4}-.0068587{col 67}{space 3} .0105135
{txt}{space 1}_Iyear_2010 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   169) = {res}   11.38
{txt}  Prob > F      = {res}  0.0009
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   169) = {res}   11.38
{txt}  Prob > F      = {res}  0.0009



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   169{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   169{txt})
{res}imms        {col 14}{txt}|{col 18}{res}   11.38{col 28}  0.0009{col 37}{txt}|{col 42}{res}   11.50{col 51}  0.0007{col 60}{txt}|{col 65}{res}   11.38

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}11.83  {col 61}{txt}P-val={res}0.0006

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   61.75
Kleibergen-Paap Wald rk F statistic{col 65}   11.38

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}169{txt})={col 49}{res}  34.54{col 61}{txt}P-val={res}0.0000
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}  34.92{col 61}{txt}P-val={res}0.0000
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}  50.20{col 61}{txt}P-val={res}0.0000

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       170
{txt}Number of observations               N  = {res}      1190
{txt}Number of regressors                 K  = {res}         7
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         7
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on svar

Number of clusters (svar) = {col 33}{res}   170{txt}{col 55}Number of obs = {res}    1190
{txt}{col 55}F(  7,   169) = {res}  308.21
{txt}{col 55}Prob > F      = {res}  0.0000
{txt}Total (centered) SS     = {res} 9.188790176{txt}{col 55}Centered R2   = {res}  0.4126
{txt}Total (uncentered) SS   = {res} 9.188790176{txt}{col 55}Uncentered R2 = {res}  0.4126
{txt}Residual SS             = {res} 5.397385979{txt}{col 55}Root MSE      = {res}  .07274

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   Dlnhpyear{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}imms {c |}{col 14}{res}{space 2}-1.786049{col 26}{space 2} .3889008{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4}-2.548281{col 67}{space 3}-1.023818
{txt}{space 1}_Iyear_2004 {c |}{col 14}{res}{space 2} .1514621{col 26}{space 2} .0115294{col 37}{space 1}   13.14{col 46}{space 3}0.000{col 54}{space 4} .1288649{col 67}{space 3} .1740593
{txt}{space 1}_Iyear_2005 {c |}{col 14}{res}{space 2} .0344658{col 26}{space 2} .0096889{col 37}{space 1}    3.56{col 46}{space 3}0.000{col 54}{space 4} .0154758{col 67}{space 3} .0534557
{txt}{space 1}_Iyear_2006 {c |}{col 14}{res}{space 2} .0214435{col 26}{space 2} .0090744{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0036579{col 67}{space 3} .0392291
{txt}{space 1}_Iyear_2007 {c |}{col 14}{res}{space 2} .0608894{col 26}{space 2} .0089723{col 37}{space 1}    6.79{col 46}{space 3}0.000{col 54}{space 4}  .043304{col 67}{space 3} .0784747
{txt}{space 1}_Iyear_2008 {c |}{col 14}{res}{space 2}-.0675697{col 26}{space 2} .0082047{col 37}{space 1}   -8.24{col 46}{space 3}0.000{col 54}{space 4}-.0836506{col 67}{space 3}-.0514887
{txt}{space 1}_Iyear_2009 {c |}{col 14}{res}{space 2}-.1523138{col 26}{space 2}  .008388{col 37}{space 1}  -18.16{col 46}{space 3}0.000{col 54}{space 4}-.1687541{col 67}{space 3}-.1358736
{txt}{space 1}_Iyear_2010 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}  11.826
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0006
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  61.746
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  11.379
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}imms
Included instruments:{col 23}_Iyear_2004 _Iyear_2005 _Iyear_2006 _Iyear_2007
{col 23}_Iyear_2008 _Iyear_2009
Excluded instruments:{col 23}inst
Dropped collinear:{col 23}_Iyear_2010
{hline 78}

{com}. 
. estimates store IV
{txt}
{com}. esttab OLS IV, keep(imms) star(* 0.1 ** 0.05 *** 0.01) b(%5.3f) se(%5.3f) stats(N)
{err}estimation result OLS not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. ssc install esttu
{txt}{err}ssc install: "esttu" not found at SSC, type {stata search esttu}
(To find all packages at SSC that start with e, type {stata ssc describe e})
{txt}{search r(601), local:r(601);}

{com}. exit, clear
